# -*- coding: utf-8 -*-
"""
Created on Thu Jan 14 11:28:43 2021

@author: finup
"""

'''
print字符输出格式如下：
'\033[a;b;cm {} \033[0m'.format('字体变色')
a-字体显示方式
b-前景色
c-背景色

显示方式: 0（默认值）、1（高亮）、22（非粗体）、4（下划线）、24（非下划线）、 5（闪烁）、25（非闪烁）、7（反显）、27（非反显）
前景色: 30（黑色）、31（红色）、32（绿色）、 33（黄色）、34（蓝色）、35（洋 红）、36（青色）、37（白色）
背景色: 40（黑色）、41（红色）、42（绿色）、 43（黄色）、44（蓝色）、45（洋 红）、46（青色）、47（白色）

'''

def prinf(x, display=0, fontcolr=31, backcolr=1):
    '''
    display-显示方式: 0（默认值）、1（高亮）、22（非粗体）、4（下划线）、24（非下划线）、 5（闪烁）、25（非闪烁）、7（反显）、27（非反显）
    fontcolr-前景色: 30（黑色）、31（红色）、32（绿色）、 33（黄色）、34（蓝色）、35（洋 红）、36（青色）、37（白色）
    backcolr-背景色: 40（黑色）、41（红色）、42（绿色）、 43（黄色）、44（蓝色）、45（洋 红）、46（青色）、47（白色）
    '''
    print('\033[{};{};{}m {} \033[0m'.format(display, fontcolr, backcolr, x))


